bigjosh/TSL-calibre-MSP/CCS Project/msp430fr413x_LCDE_03.c/tsl-calibre-msp.cpp
    LCDM0 = 0x21;                                       // L0 = COM0, L1 = COM1
    LCDM1 = 0x84;                                       // L2 = COM2, L3 = COM3
*/

    // For TSL
    // Configure COMs and SEGs
    LCDCSSEL0 = LCDCSS8 | LCDCSS9 | LCDCSS10 | LCDCSS11 ;     // L8-L11 are the 4 COM pins
    LCDCSSEL1 = 0x0000;
    LCDCSSEL2 = 0x0000;

    // L08 = MSP_COM3 = LCD_COM3
    // L09 = MSP_COM2 = LCD_COM2
    // L10 = MSP_COM1 = LCD_COM1
    // L11 = MSP_COM0 = LCD_COM0

    // Once we have selected the COM lines above, we have to connect them in the LCD memory. See Figure 17-2 in MSP430FR4x family guide.
    // Each nibble in the LCDMx regs holds 4 bits connecting the L pin to one of the 4 COM lines (two L pins per reg)


    LCDM4 =  0b01001000;  // L09=MSP_COM2  L08=MSP_COM3
    LCDM5 =  0b00010010;  // L10=MSP_COM0  L11=MSP_COM1



    LCDCTL0 |= LCDON;                                           // Turn on LCD


    lcd_show_f( 0,0 );
    lcd_show_f( 1,1 );
    lcd_show_f( 2,2 );
    lcd_show_f( 3,3 );
    lcd_show_f( 4,4 );
    lcd_show_f( 5,5 );
    lcd_show_f( 6,6 );
    lcd_show_f( 7,7 );
    lcd_show_f( 8,8 );
    lcd_show_f( 9,9 );
    lcd_show_f(10,0x0a );
    lcd_show_f(11,0x0b );
    //wiggleFlash();

    *Seconds=00;        // Make it so we can see if we woke


/*

    // Set up RTC



    RTCMOD = 10000;                                     // Set RTC modulo to 10000 to trigger interrupt each second on 10Khz VLO clock. This will get loaded into the shadow register on next trigger or reset
//        RTCMOD = 10000;                                     // Set RTC modulo to 1000 to trigger interrupt each 0.1 second on 10Khz VLO clock. This will get loaded into the shadow register on next trigger or reset

    RTCCTL |=  RTCSR;                    // reset RTC which will load overflow value into shadow reg and reset the counter to 0,  and generate RTC interrupt

    RTCIV;                      // Clear any pending RTC interrupt

    // TRY THIS, MUST ALSO ADJUST LCDSEL
    // Use VLO instead of XTAL
    //RTCCTL = RTCSS__VLOCLK | RTCIE;                    // Initialize RTC to use Very Low Oscillator and enable RTC interrupt on rollover
    RTCCTL = 0x00;                    // Disable RTC

*/



    // Setup the RV3032

    // We will only be using the ~INT signal form the RV3032 to tick our ticker. We will use the periodic timer running at 500ms
    // to generate that tick. It would be better to use the 1s tick (fewer ISR wake-ups) but the width of the pulse is 7.8ms (much wider) for the seconds
    // timebase and that would waste power fighting against the pull-up, so we must use the shorter one which is 122us.
    // Note that the first period can be off by as much as 244.14 us. We will have to live with this - hopefully users will not notice.
    // TODO: We could also use the shorter timebase with a 0.9998s period and then keep track of the error and add a periodic offset. But this
    //       would be ugly when the extra tick happened. :/

    // We will be using the internal diode to charge the backup capacitors connected to Vbackup with these settings...
    // TCM=01 - Connects Vdd to the charging circuit
    // DSM=01 - Direct switchover mode, switches whenever Vbackup>Vcc
    // TCR=00 - Selects a 1K ohm trickle charge resistor

    // Give the RV3230 a chance to wake up before we start pounding it.
    // POR refresh time(1) At power up ~66ms
    __delay_cycles(100000);

    // Initialize our i2c pins as pull-up
    i2c_init();


    // Set all the registers

    // First control reg. Note that turning off backup switch-over seems to save ~0.1uA
    //uint8_t pmu_reg = 0b01000001;         // CLKOUT off, backup switchover disabled, no charge pump, 1K OHM trickle resistor, trickle charge Vbackup to Vdd.
    uint8_t pmu_reg = 0b01010001;         // CLKOUT off, Direct backup switching mode, no charge pump, 1K OHM trickle resistor, trickle charge Vbackup to Vdd. Only predicted to use 50nA more than disabled.
    //uint8_t pmu_reg = 0b01100001;         // CLKOUT off, Level backup switching mode (2v) , no charge pump, 1K OHM trickle resistor, trickle charge Vbackup to Vdd

    //uint8_t pmu_reg = 0b01110001;         // CLKOUT off, Other disabled backup switching mode  , no charge pump, 1K OHM trickle resistor, trickle charge Vbackup to Vdd

    i2c_write( RV_3032_I2C_ADDR , 0xc0 , &pmu_reg , 1 );


    // Now that CLKOUT is disabled on the RV3032, it is supposed to be driven low, but seems to float sometimes
    // so lets pull it low on the MSP430 to prevent float leakage.
    CBI( RV3032_CLKOUT_POUT , RV3032_CLKOUT_B );
    SBI( RV3032_CLKOUT_PREN , RV3032_CLKOUT_B );


    // Periodic Timer value = 2048 for 500ms

    const unsigned timerValue = 2048;
    uint8_t timerValueH = timerValue / 0x100;
    uint8_t timerValueL = timerValue % 0x100;
    i2c_write( RV_3032_I2C_ADDR , 0x0b , &timerValueL  , 1 );
    i2c_write( RV_3032_I2C_ADDR , 0x0c , &timerValueH  , 1 );

    // Set TIE in Control 2 to 1 t enable interrupt pin for periodic countdown
    uint8_t control2_reg = 0b00010000;
    i2c_write( RV_3032_I2C_ADDR , 0x11 , &control2_reg , 1 );

    // set TD to 00 for 4068Hz timer, TE=1 to enable periodic countdown timer, EERD=1 to disable automatic EEPROM refresh (why would you want that?). Bit 5 not used but must be set to 1.
    uint8_t control1_reg = 0b00011100;
    i2c_write( RV_3032_I2C_ADDR , 0x10 , &control1_reg , 1 );

    // OK, we will now get a 122uS low pulse on INT every 500ms.


    // Next check if the RV3032 just powered up, or if it was already running and show a 1 in digit 10 if it was running (0 if not)
    uint8_t status_reg=0xff;
    i2c_read( RV_3032_I2C_ADDR , 0x0d , &status_reg , 1 );

    if ( (status_reg & 0x03) == 0 ) {               //If power on reset or low voltage drop detected then we have not been running continuously
        lcd_show_f(1, 0x0f );
        lcd_show_f(2, 0x00 );
    } else {
        lcd_show_f(1, 0x00 );
        lcd_show_f(2, 0x0f );
    }
    status_reg =0x00;   // Clear all flags for next time we check
    i2c_write( RV_3032_I2C_ADDR , 0x0d , &status_reg , 1 );


    // Next check if the RV3032 just powered up, or if it was already running and show a 1 in digit 10 if it was running (0 if not)
    uint8_t sec_reg=0xff;
    i2c_read( RV_3032_I2C_ADDR , 0x01 , &sec_reg , 1 );

