bigjosh/TSL-calibre-MSP/CCS Project/msp430fr413x_LCDE_03.c/tsl-calibre-msp.cpp
    /*
    lcd_show_f( 11 , sec_reg / 0x10  );
    lcd_show_f( 10 , sec_reg & 0x0f );
    */

    i2c_write( RV_3032_I2C_ADDR , 0x01 , &sec_reg , 1 );


    // We are done setting stuff up with the i2c connection, so drive the pins low
    // This will hopefully reduce leakage and also keep them from floating into the
    // RV3032 when the MSP430 looses power during a battery change.

    i2c_shutdown();



    // TODO: Why doesn't this work?
    //LCDMEMCTL |= LCDCLRM;                               // Clear LCD memory command (executed one shot)
    //while (LCDMEMCTL & LCDCLRM);                        // Wait for clear to complete before moving on
/*
    lcd_show< 0,0>();
    lcd_show< 1,1>();
    lcd_show< 2,2>();
    lcd_show< 3,3>();
    lcd_show< 4,4>();
    lcd_show< 5,5>();
    lcd_show< 6,6>();
    lcd_show< 7,7>();
    lcd_show< 8,8>();
    lcd_show< 9,9>();
    lcd_show<10,0>();
    lcd_show<11,1>();
*/

    /*
    unsigned f = PMMIFG;        // Read reset flags

    if (f & PMMLPM5IFG) {       // Wake from LPMx.5
        lcd_show< 7,1>();
    }


    if (f & SVSHIFG) {          // SVS low side interrupt flag (power up)
        lcd_show< 6,1>();
    }


    if (f & PMMPORIFG) {
        lcd_show< 5,1>();
    }

    if (f & PMMPORIFG) {
        lcd_show< 4,1>();
    }

    if (f & PMMRSTIFG) {            // Reset pin
          lcd_show< 3,1>();
      }


    if (f & PMMBORIFG) {
          lcd_show< 2,1>();
    }


    SYSRSTIV = 0x00;
    unsigned iv = SYSRSTIV;

    if (iv!=0x0000) {
        lcd_show< 8,1>();
    }

    */

    //Enter LPM3 with SVS off
    //PMMCTL0_L &= ~SVSHE ;                           // disable SVS (prob ~0.2uA, default is on)
    //TODO:Turn off LPM3.5 switch before sleeping? //LPM5SW

    // Datasheet says this will be 1.25uA with LCD...
    // Low-power mode 3, VLO, excludes SVS test conditions:
    // Current for watchdog timer clocked by VLO included. RTC disabled. Current for brownout included. SVS disabled (SVSHE = 0).
    // CPUOFF = 1, SCG0 = 1 SCG1 = 1, OSCOFF = 0 (LPM3),

    // "the WDTHOLD bit can be used to hold the WDTCNT, reducing power consumption."


    //WDTCTL = WDTPW | WDTSSEL__VLO | WDTHOLD;                               // Select VLO for WDT clock, halt watchdog timer


    // "After reset, RTCSS defaults to 00b (disabled), which means that no clock source is selected."



/*
    // Disabling the System Voltage Supervisor is supposed to save us about 2uA, but no effect found in testing. If anything, seems to add about 0.01uA.

    PMMCTL0_H = PMMPW_H;            // Open PMM Registers for write
    CBI( PMMCTL0_L  , SVSHE ) ;     // 0b = High-side SVS (SVSH) is disabled in LPM2, LPM3, LPM4, LPM3.5, and LPM4.5 (prob ~0.2uA, default is on)

*/


    // TODO: Try switching MCLK to VLO. We will run really slow.... but maybe save power?
    // CSCTL4 = SELMS__VLOCLK;
    // Nope, uses MORE power 4.5uA vs 2.3uA. Maybe the FLO clock is still running?



    /*
        Reset interrupt vector. Generates a value that can be used as address offset for
        fast interrupt service routine handling to identify the last cause of a reset (BOR,
        POR, or PUC). Writing to this register clears all pending reset source flags.
    */


    SYSRSTIV = 0x00;            // Clear all pending reset sources


    __bis_SR_register( LPM4_bits | GIE );                    // Enter LPM4 - 2.12uA with static @ Vcc=3.5V, 2.2uA with simple counting

/*
    The LMPx.5 modes are very not worth it for us since they waste so much power on extended wake up time.
    They would only be worth it if you were sleeping >minutes, not 500ms like we are.

*/
/*
    SBI( DEBUGA_POUT , DEBUGA_B );


    // Go into LPMx.5 sleep
    PMMCTL0_H = PMMPW_H;                               // Open PMM Registers for write
    PMMCTL0_L |= PMMREGOFF_L;                           // and set PMMREGOFF also clears SVS
    // TODO: datasheets say SVS off makes wakeup 10x slower, so need to test when wake works

//        __bis_SR_register( LPM3_bits | GIE );                    // Enter LPM3.5 - 1.87uA with static @ Vcc=3.5V, , 4.8uA with simple counting
//        __bis_SR_register( LPM4_bits | GIE );                    // Enter LPM4.5 - 1.87uA with static @ Vcc=3.5V, 4.5uA with simple counting

*/
    /*
    PMMCTL0_H = PMMPW_H;                                // Open PMM Registers for write
    PMMCTL0_L = PMMREGOFF_L | SVSHE;                   // and set PMMREGOFF (go into a x.5 mode on next sleep) and disable low voltage monitor

    __bis_SR_register(LPM3_bits | GIE);                 // Enter LPM3.5
    __no_operation();                                   // For debugger
     */

    while (1) {

        lcd_show< 9,2>();
        __delay_cycles(1000000);
        lcd_show< 9,3>();
        __delay_cycles(1000000);

    }

}


#pragma vector = PORT1_VECTOR

__interrupt void PORT1_ISR(void) {

    // Wake time measured at 48us
    // TODO: Make sure there are no avoidable push/pops happening at ISR entry (seems too long)

    SBI( DEBUGA_POUT , DEBUGA_B );      // See latency to start ISR and how long it runs

    if ( TBI( TRIGGER_SWITCH_PIFG , TRGIGER_SWITCH_B ) ) {

        if ( !TBI( TRGIGER_SWITCH_PIN , TRGIGER_SWITCH_B ) ) {      // Just to be safe. make sure it is still low (slight amount of glitch filtering during ISR latency time)
            // Interrupt from the trigger pin high to low

            // Show the flash
            //wiggleFlashQ1();

            // Note that the flash takes a fraction of a second, so will debounce the trigger pin
            // and the following line will clear all the edges that happened.

            if (*triggerSpin<9) {
                (*triggerSpin)++;
            } else {
                (*triggerSpin)=0;
            }

            lcd_show_f( 9, *triggerSpin);
        }

        CBI( TRIGGER_SWITCH_PIFG , TRGIGER_SWITCH_B );      // Clear pending interrupt flag

    }


    if ( TBI( RV3032_INT_PIFG , RV3032_INT_B ) ) {

        // TODO: Disable pull-up while in ISR

        if (*spin<9) {
            (*spin)++;
        } else {
            (*spin)=0;
        }

        lcd_show_f( 0 , *spin);

        CBI( RV3032_INT_PIFG , RV3032_INT_B );      // Clear pending interrupt flag

    }

    CBI( DEBUGA_POUT , DEBUGA_B );

}


#pragma vector = RTC_VECTOR

__interrupt void RTC_ISR(void) {

    lcd_show< 9,1>();

    SBI( DEBUGA_POUT , DEBUGA_B );

    // Currently we never make it here in LPM3.5

    //RTCIV;
    //__no_operation();                                   // For debugger


    //(LCDMEM[pos4])++;//= digit[4];

    /*

    (LCDMEM[pos2])= digit[1];


    PMMCTL0_H = PMMPW_H;                                // Open PMM Registers for write
    PMMCTL0_L |= PMMREGOFF_L;                           // and set PMMREGOFF
    __bis_SR_register(LPM3_bits | GIE);                 // Re-enter LPM3.5

    (LCDMEM[pos2])= digit[6];

    */

    /*

    Inc_RTC();

    (LCDMEM[pos4]) = digit[4];

    PMMCTL0_H = PMMPW_H;                                // Open PMM Registers for write
    PMMCTL0_L |= PMMREGOFF_L;                           // and set PMMREGOFF
    __bis_SR_register(LPM3_bits | GIE);                 // Re-enter LPM3.5
*/

    CBI( DEBUGA_POUT , DEBUGA_B );

}

